# LinkLoadResult Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult Class
Members See Also
---
This class stores the results of trying to load a single linked model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class LinkLoadResult : IDisposable
```

Visual Basic
---
```text
Public Class LinkLoadResult _
	Implements IDisposable
```

Visual C++
---
```text
public ref class LinkLoadResult : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..LinkLoadResult
# See Also
LinkLoadResult Members
Autodesk.Revit.DB Namespace